badgeteam/mch2022-firmware-esp32/main/main.c
esp_err_t draw_menu(pax_buf_t* buffer) {
    pax_push_2d(buffer);
        //pax_apply_2d(buffer, matrix_2d_translate(0, 0));
        //pax_apply_2d(buffer, matrix_2d_scale(1, 1));
        pax_simple_line(buffer, pax_col_rgb(0,0,0), 0, 20, 320, 20);
        pax_draw_text(buffer, pax_col_rgb(0,0,0), PAX_FONT_DEFAULT, 18, 0, 0, "Launcher");
        menu_item_t* item = first_menu_item;
        for (uint8_t index = 0; index < amount_of_items; index++) {
            if (item != NULL) {
                draw_menu_item(buffer, index, (selected_item == index), item->name);
            }
            item = item->next;
        }
    pax_pop_2d(buffer);
    return ESP_OK;
}

pax_col_t regenboogkots(pax_col_t tint, int x, int y, float u, float v, void *args) {
  return pax_col_hsv(x / 50.0 * 255.0 + y / 150.0 * 255.0, 255, 255);
}

pax_shader_t kots = {
    .callback = regenboogkots
};

esp_err_t graphics_task(pax_buf_t* buffer, ILI9341* ili9341, uint8_t* framebuffer) {
    pax_background(buffer, 0xFFFFFF);
    //pax_shade_rect(buffer, 0, &kots, NULL, 0, 0, 320, 240);
    pax_push_2d(buffer);
        pax_apply_2d(buffer, matrix_2d_translate(buffer->width / 2.0, buffer->height / 2.0 + 10));
        pax_apply_2d(buffer, matrix_2d_scale(50, 50));
        uint64_t millis = esp_timer_get_time() / 1000;
        pax_col_t color0 = pax_col_hsv(millis * 255 / 8000, 255, 255);
        //pax_col_t color1 = pax_col_hsv(millis * 255 / 8000 + 127, 255, 255);
        float a0 = rotation.y * (M_PI / 360.0);//millis / 3000.0 * M_PI;//0;//
        //printf("%f from %f\n", a0, rotation.y);
        //float a1 = fmodf(a0, M_PI * 4) - M_PI * 2;////
        //pax_draw_arc(buffer, color0, 0, 0, 2, a0 + M_PI, a0);
        /*pax_push_2d(buffer);
            pax_apply_2d(buffer, matrix_2d_rotate(a0));
            pax_push_2d(buffer);
                pax_apply_2d(buffer, matrix_2d_translate(1, 0));
                pax_draw_rect(buffer, color1, -0.25, -0.25, 0.5, 0.5);
            pax_pop_2d(buffer);
            pax_apply_2d(buffer, matrix_2d_rotate(a1));
            pax_push_2d(buffer);
                pax_apply_2d(buffer, matrix_2d_translate(1, 0));
                pax_apply_2d(buffer, matrix_2d_rotate(-a0 - a1 + M_PI * 0.5));
                pax_draw_tri(buffer, color1, 0.25, 0, -0.125, 0.2165, -0.125, -0.2165);
            pax_pop_2d(buffer);
        pax_pop_2d(buffer);*/
    pax_pop_2d(buffer);
        
    draw_menu(buffer);

    //driver_framebuffer_print(NULL, "Hello world", 0, 0, 1, 1, 0xFF00FF, &ocra_22pt7b);
    return ili9341_write(ili9341, framebuffer);
}

esp_err_t draw_message(pax_buf_t* buffer, ILI9341* ili9341, uint8_t* framebuffer, char* message) {
    pax_background(buffer, 0xFFFFFF);
    pax_draw_text(buffer, pax_col_rgb(0,0,0), PAX_FONT_DEFAULT, 18, 0, 0, message);
    return ili9341_write(ili9341, framebuffer);
}

void print_chip_info(void) {
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    printf("This is %s chip with %d CPU core(s), WiFi%s%s, ",
            CONFIG_IDF_TARGET,
            chip_info.cores,
            (chip_info.features & CHIP_FEATURE_BT) ? "/BT" : "",
            (chip_info.features & CHIP_FEATURE_BLE) ? "/BLE" : "");

    printf("silicon revision %d, ", chip_info.revision);

    printf("%dMB %s flash\n", spi_flash_get_chip_size() / (1024 * 1024),
            (chip_info.features & CHIP_FEATURE_EMB_FLASH) ? "embedded" : "external");

    printf("Minimum free heap size: %d bytes\n", esp_get_minimum_free_heap_size());   
}

uint8_t* load_file_to_ram(FILE* fd, size_t* fsize) {
    fseek(fd, 0, SEEK_END);
    *fsize = ftell(fd);
    fseek(fd, 0, SEEK_SET);
    uint8_t* file = malloc(*fsize);
    if (file == NULL) return NULL;
    fread(file, *fsize, 1, fd);
    return file;
}

esp_err_t load_file_into_psram(FILE* fd) {
    fseek(fd, 0, SEEK_SET);
    const uint8_t write_cmd = 0x02;
    uint32_t amount_read;
    uint32_t position = 0;
    uint8_t* tx_buffer = malloc(SPI_MAX_TRANSFER_SIZE);
    if (tx_buffer == NULL) return ESP_FAIL;

    while(1) {
        tx_buffer[0] = write_cmd;
        tx_buffer[1] = (position >> 16);
        tx_buffer[2] = (position >> 8) & 0xFF;
        tx_buffer[3] = position & 0xFF;
        amount_read = fread(&tx_buffer[4], 1, SPI_MAX_TRANSFER_SIZE - 4, fd);
        if (amount_read < 1) break;
        ESP_LOGI(TAG, "Writing PSRAM @ %u (%u bytes)", position, amount_read);
        esp_err_t res = ice40_transaction(ice40, tx_buffer, amount_read + 4, NULL, 0);
        if (res != ESP_OK) {
            ESP_LOGE(TAG, "Write transaction failed @ %u", position);
            free(tx_buffer);
            return res;
        }
        position += amount_read;
    };
    free(tx_buffer);
    return ESP_OK;
}

esp_err_t load_buffer_into_psram(uint8_t* buffer, uint32_t buffer_length) {
    const uint8_t write_cmd = 0x02;
    uint32_t position = 0;
    uint8_t* tx_buffer = malloc(SPI_MAX_TRANSFER_SIZE);
    if (tx_buffer == NULL) return ESP_FAIL;
    while(1) {
        tx_buffer[0] = write_cmd;
        tx_buffer[1] = (position >> 16);
        tx_buffer[2] = (position >> 8) & 0xFF;
        tx_buffer[3] = position & 0xFF;
        uint32_t length = buffer_length - position;
        if (length > SPI_MAX_TRANSFER_SIZE - 4) length = SPI_MAX_TRANSFER_SIZE - 4;
        memcpy(&tx_buffer[4], &buffer[position], length);
        if (length == 0) break;
        ESP_LOGI(TAG, "Writing PSRAM @ %u (%u bytes)", position, length);
        esp_err_t res = ice40_transaction(ice40, tx_buffer, length + 4, NULL, 0);
        if (res != ESP_OK) {
            ESP_LOGE(TAG, "Write transaction failed @ %u", position);
            free(tx_buffer);
            return res;
        }
        position += length;
    };
    free(tx_buffer);
    return ESP_OK;
}

esp_err_t verify_file_in_psram(FILE* fd) {
    fseek(fd, 0, SEEK_SET);
    const uint8_t read_cmd = 0x03;
    uint32_t amount_read;
    uint32_t position = 0;
    uint8_t* tx_buffer = malloc(SPI_MAX_TRANSFER_SIZE);
    if (tx_buffer == NULL) return ESP_FAIL;
    memset(tx_buffer, 0, SPI_MAX_TRANSFER_SIZE);
    uint8_t* verify_buffer = malloc(SPI_MAX_TRANSFER_SIZE);
    if (verify_buffer == NULL) return ESP_FAIL;
    uint8_t* rx_buffer = malloc(SPI_MAX_TRANSFER_SIZE);
    if (rx_buffer == NULL) return ESP_FAIL;

    while(1) {
        tx_buffer[0] = read_cmd;
        tx_buffer[1] = (position >> 16);
        tx_buffer[2] = (position >> 8) & 0xFF;
        tx_buffer[3] = position & 0xFF;
        amount_read = fread(&verify_buffer[4], 1, SPI_MAX_TRANSFER_SIZE - 4, fd);
        if (amount_read < 1) break;
        ESP_LOGI(TAG, "Reading PSRAM @ %u (%u bytes)", position, amount_read);
        esp_err_t res = ice40_transaction(ice40, tx_buffer, amount_read + 4, rx_buffer, amount_read + 4);
        if (res != ESP_OK) {
            ESP_LOGE(TAG, "Read transaction failed @ %u", position);
            free(tx_buffer);
            return res;
        }
        position += amount_read;
        ESP_LOGI(TAG, "Verifying PSRAM @ %u (%u bytes)", position, amount_read);
        for (uint32_t i = 4; i < amount_read; i++) {
            if (rx_buffer[i] != verify_buffer[i]) {
                ESP_LOGE(TAG, "Verifying PSRAM @ %u failed: %02X != %02X", position + i, rx_buffer[i], verify_buffer[i]);
                free(tx_buffer);
                free(rx_buffer);
                free(verify_buffer);
                return ESP_FAIL;
            }
        }
    };
    free(tx_buffer);
    free(rx_buffer);
    free(verify_buffer);
    ESP_LOGI(TAG, "PSRAM contents verified!");
    return ESP_OK;
}

void fpga_test(void) {
    esp_err_t res;
    FILE* fpga_passthrough = fopen("/sd/pt.bin", "rb");
    if (fpga_passthrough == NULL) {
        ESP_LOGE(TAG, "Failed to open passthrough firmware (pt.bin) from the SD card");
        return;
    }

    ESP_LOGI(TAG, "Loading passthrough bitstream into RAM buffer...");
    size_t fpga_passthrough_bitstream_length;
    uint8_t* fpga_passthrough_bitstream = load_file_to_ram(fpga_passthrough, &fpga_passthrough_bitstream_length);
    fclose(fpga_passthrough);
    ESP_LOGI(TAG, "Loading passthrough bitstream into FPGA...");
    res = ice40_load_bitstream(ice40, fpga_passthrough_bitstream, fpga_passthrough_bitstream_length);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to load passthrough bitstream into FPGA (%d)", res);
        return;
    }
    free(fpga_passthrough_bitstream);
    
    FILE* ram_contents = fopen("/sd/ram.bin", "rb");
    if (ram_contents == NULL) {
        ESP_LOGE(TAG, "Failed to open ram.bin");
        return;
    }
    
    res = load_file_into_psram(ram_contents);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to load RAM contents into PSRAM (%d)", res);
        fclose(ram_contents);
        return;
    }
    
    res = verify_file_in_psram(ram_contents);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to verify PSRAM contents (%d)", res);
        fclose(ram_contents);
        return;
    }
    
