badgeteam/mch2022-firmware-esp32/main/main.c
    FILE* fpga_app = fopen("/sd/app.bin", "rb");
    if (fpga_app == NULL) {
        ESP_LOGE(TAG, "Failed to open app.bin");
        return;
    }
    
    ESP_LOGI(TAG, "Loading app bitstream into RAM buffer...");
    size_t fpga_app_bitstream_length;
    uint8_t* fpga_app_bitstream = load_file_to_ram(fpga_app, &fpga_app_bitstream_length);
    fclose(fpga_app);

    ili9341_deinit(ili9341);
    vTaskDelay(10 / portTICK_PERIOD_MS);
    ili9341_select(ili9341, true);

    ESP_LOGI(TAG, "Loading app bitstream into FPGA...");
    res = ice40_load_bitstream(ice40, fpga_app_bitstream, fpga_app_bitstream_length);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to load app bitstream into FPGA (%d)", res);
        return;
    }
    
    free(fpga_app_bitstream);
}

esp_err_t appfs_init(void) {
    return appfsInit(APPFS_PART_TYPE, APPFS_PART_SUBTYPE);
}

void appfs_store_app(void) {
    esp_err_t res;
    appfs_handle_t handle;
    FILE* app_fd = fopen("/sd/gnuboy.bin", "rb");
    if (app_fd == NULL) {
        ESP_LOGE(TAG, "Failed to open gnuboy.bin");
        return;
    }
    size_t app_size;
    uint8_t* app = load_file_to_ram(app_fd, &app_size);
    if (app == NULL) {
        ESP_LOGE(TAG, "Failed to load application into RAM");
        return;
    }
    
    ESP_LOGI(TAG, "Application size %d", app_size);
    
    res = appfsCreateFile("gnuboy", app_size, &handle);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create file on AppFS (%d)", res);
        free(app);
        return;
    }
    res = appfsWrite(handle, 0, app, app_size);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to write to file on AppFS (%d)", res);
        free(app);
        return;
    }
    free(app);
    ESP_LOGI(TAG, "Application is now stored in AppFS");
    return;
}

void appfs_boot_app(int fd) {
    if (fd<0 || fd>255) {
        REG_WRITE(RTC_CNTL_STORE0_REG, 0);
    } else {
        REG_WRITE(RTC_CNTL_STORE0_REG, 0xA5000000|fd);
    }
    
    esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_SLOW_MEM, ESP_PD_OPTION_ON);
    esp_sleep_enable_timer_wakeup(10);
    esp_deep_sleep_start();
}

void appfs_test(bool sdcard_ready) {
    appfs_handle_t fd = appfsOpen("gnuboy");
    if (fd < 0) {
        ESP_LOGW(TAG, "gnuboy not found in appfs");
        if (sdcard_ready) {
            appfs_store_app();
            appfs_test(false); // Recursive, but who cares :D
        }
    } else {
        ESP_LOGE(TAG, "booting gnuboy from appfs (%d)", fd);
        appfs_boot_app(fd);
    }
}

void app_main(void) {
    esp_err_t res;
    
    uint8_t* framebuffer = heap_caps_malloc(ILI9341_BUFFER_SIZE, MALLOC_CAP_8BIT);
    if (framebuffer == NULL) {
        ESP_LOGE(TAG, "Failed to allocate framebuffer");
        restart();
    }
    memset(framebuffer, 0, ILI9341_BUFFER_SIZE);
    
    pax_buf_t buffer;
    pax_buf_init(&buffer, framebuffer, ILI9341_WIDTH, ILI9341_HEIGHT, PAX_BUF_16_565RGB);
    driver_framebuffer_init(framebuffer);
    
    res = board_init();
    
    if (res != ESP_OK) {
        printf("Failed to initialize hardware!\n");
        restart();
    }
    
    ili9341 = get_ili9341();
    ice40 = get_ice40();
    bno055 = get_bno055();
    rp2040 = get_rp2040();
        
    //print_chip_info();
    
    draw_message(&buffer, ili9341, framebuffer, "Button init...");
    button_init();
    
    draw_message(&buffer, ili9341, framebuffer, "AppFS init...");
    res = appfs_init();
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "AppFS init failed: %d", res);
        return;
    }
    ESP_LOGI(TAG, "AppFS initialized");
    
    draw_message(&buffer, ili9341, framebuffer, "Mount SD card...");
    res = mount_sd(SD_CMD, SD_CLK, SD_D0, SD_PWR, "/sd", false, 5);
    bool sdcard_ready = (res == ESP_OK);
    
    /*if (sdcard_ready) {
        ESP_LOGI(TAG, "SD card mounted");
        draw_message(&buffer, ili9341, framebuffer, "AppFS test...");
        appfs_test(sdcard_ready);
        draw_message(&buffer, ili9341, framebuffer, "FPGA init...");
        fpga_test();
    } else {
        draw_message(&buffer, ili9341, framebuffer, "No SD card?");
    }*/
        
    //
    
    menu_item_t* current_menu_item = NULL;
    appfs_handle_t current_fd = APPFS_INVALID_FD;
    
    amount_of_items = 0;
    selected_item = 0;
    
    do {
        current_fd = appfsNextEntry(current_fd);
        if (current_fd != APPFS_INVALID_FD) {
            menu_item_t* next_menu_item = malloc(sizeof(menu_item_t));
            if (current_menu_item != NULL) {
                current_menu_item->next = next_menu_item;
            } else {
                first_menu_item = next_menu_item;
            }
            current_menu_item = next_menu_item;
            appfsEntryInfo(current_fd, &current_menu_item->name, NULL);
            current_menu_item->fd = current_fd;
            current_menu_item->action = ACTION_NONE;
            current_menu_item->next = NULL;
            printf("Building menu list %u: %s\r\n", amount_of_items, current_menu_item->name);
            amount_of_items++;
        }
    } while (current_fd != APPFS_INVALID_FD);
    printf("Building menu list done, %u items\r\n", amount_of_items);
    
    menu_item_t* next_menu_item = malloc(sizeof(menu_item_t));
    if (current_menu_item != NULL) {
        current_menu_item->next = next_menu_item;
    } else {
        first_menu_item = next_menu_item;
    }
    current_menu_item = next_menu_item;
    current_menu_item->fd = APPFS_INVALID_FD;
    current_menu_item->action = ACTION_INSTALLER;
    current_menu_item->name = installer_name;
    current_menu_item->next = NULL;
    amount_of_items++;
    
    
    while (1) {
        //bno055_task(bno055);
        graphics_task(&buffer, ili9341, framebuffer);
        printf("Selected: %u of %u\r\n", selected_item + 1, amount_of_items);
        if (start_selected) {
            current_menu_item = first_menu_item;
            for (uint8_t index = 0; index < selected_item; index++) {
                current_menu_item = current_menu_item->next;
            }
            if (current_menu_item->action == ACTION_INSTALLER) {
                draw_message(&buffer, ili9341, framebuffer, "Starting installer...");
            } else {
                draw_message(&buffer, ili9341, framebuffer, "Starting app...");
                appfs_boot_app(current_menu_item->fd);
            }
        }
    }
    /*
    uint8_t data_out, data_in;
    
    enum {
        I2C_REGISTER_FW_VER,
        I2C_REGISTER_GPIO_DIR,
        I2C_REGISTER_GPIO_IN,
        I2C_REGISTER_GPIO_OUT,
        I2C_REGISTER_LCD_MODE,
        I2C_REGISTER_LCD_BACKLIGHT,
    };

    data_out = 1 << 2; // Proto 0 pin is output
    res = i2c_write_reg_n(I2C_BUS_EXT, 0x17, I2C_REGISTER_GPIO_DIR, &data_out, 1);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set GPIO direction on Pico: %d", res);
        return;
    }
    
